## Question 1

In [8]:

a = 0
def b():
 global a
 a = c(a)
def c(a):
 return a + 2

In [9]:
b()

In [10]:
b()

In [11]:
b()

In [12]:
a

6

In [ ]:
#when global a = 0, the function c(a) which is to return a+2 will then be 0+2=2
#for each b(), there will be additional 2 added to the output which then gives the final output as 6

## Question 10

In [164]:
word = ['The', 'quick', 'brown', 'fox', 'jumps', 'over', 'the', 'lazy', 'dog'] 
Caps = []
for the in word:
    Caps.append(the.upper())

print(Caps)

['THE', 'QUICK', 'BROWN', 'FOX', 'JUMPS', 'OVER', 'THE', 'LAZY', 'DOG']

In [165]:
word= ['The', 'quick', 'brown', 'fox', 'jumps', 'over', 'the', 'lazy', 'dog'] 

Length = []

for the in word:
    Length.append(len(the))
    
print(Length)

[3, 5, 5, 3, 5, 4, 3, 4, 3]

In [166]:
word= ['The', 'quick', 'brown', 'fox', 'jumps', 'over', 'the', 'lazy', 'dog'] 
Lower=[]
for the in word:
    Lower.append(the.lower())

print(Lower)

['the', 'quick', 'brown', 'fox', 'jumps', 'over', 'the', 'lazy', 'dog']

In [167]:
list(map(list, zip(Caps, Lower,Length)))

[['THE', 'the', 3],
 ['QUICK', 'quick', 5],
 ['BROWN', 'brown', 5],
 ['FOX', 'fox', 3],
 ['JUMPS', 'jumps', 5],
 ['OVER', 'over', 4],
 ['THE', 'the', 3],
 ['LAZY', 'lazy', 4],
 ['DOG', 'dog', 3]]

In [175]:
word= ['The', 'quick', 'brown', 'fox', 'jumps', 'over', 'the', 'lazy', 'dog'] 

character=[]

for b in word:
    if len(b)>=4:
     character.append(b)

print(character)

['quick', 'brown', 'jumps', 'over', 'lazy']

## Question 9

In [28]:
import pandas as pd

In [29]:
Weatherinfo = pd.read_csv(r'C:\Users\brigh\Desktop\BDAT\Semester 1\Data Programming\BDAT1002 .csv')

In [31]:
Weatherinfo

      City         Country    Season  Temperature\n(C)  Rainfall (mm)\n
0   Mumbai           India   Winter               24.8              5.9
1    Mumbai          India   Spring               28.4             16.2
2   Mumbai           India   Summer               27.9           1549.4
3   Mumbai           India     Fall               27.6            346.0
4    London  Unted Kingdom    Winter               4.2            207.7
5   London   Unted Kingdom    Spring               8.3            169.6
6    London  Unted Kingdom    Summer              15.7            157.0
7   London   Unted Kingdom     Fall               10.4            218.5
8   Cairo            Egypt    Winter              13.6             16.5
9    Cairo           Egypt   Spring               20.7              6.5
10   Cairo           Egypt    Summer              27.7              0.1
11  Cairo            Egypt     Fall               22.2              4.5

In [208]:
Weatherinfo.set_index('Season', inplace = True)

NameError: name 'Weatherinfo' is not defined

In [37]:
#import table from system
Weatherinfo1 = pd.read_csv(r'C:\Users\brigh\Desktop\BDAT\Semester 1\Data Programming\Weatherinfo.csv')

In [38]:
Weatherinfo1

     Nation        Country    Season  Temperature\n(C)  Rainfall (mm)\n
0   Mumbai           India   Winter               24.8              5.9
1    Mumbai          India   Spring               28.4             16.2
2   Mumbai           India   Summer               27.9           1549.4
3   Mumbai           India     Fall               27.6            346.0
4    London  Unted Kingdom    Winter               4.2            207.7
5   London   Unted Kingdom    Spring               8.3            169.6
6    London  Unted Kingdom    Summer              15.7            157.0
7   London   Unted Kingdom     Fall               10.4            218.5
8   Cairo            Egypt    Winter              13.6             16.5
9    Cairo           Egypt   Spring               20.7              6.5
10   Cairo           Egypt    Summer              27.7              0.1
11  Cairo            Egypt     Fall               22.2              4.5

In [40]:
Weatherinfo1.set_index('Nation', inplace = True)

In [41]:
Weatherinfo1

               Country    Season  Temperature\n(C)  Rainfall (mm)\n
Nation
Mumbai           India   Winter               24.8              5.9
Mumbai           India   Spring               28.4             16.2
Mumbai           India   Summer               27.9           1549.4
Mumbai           India     Fall               27.6            346.0
London   Unted Kingdom    Winter               4.2            207.7
London   Unted Kingdom    Spring               8.3            169.6
London   Unted Kingdom    Summer              15.7            157.0
London   Unted Kingdom     Fall               10.4            218.5
Cairo            Egypt    Winter              13.6             16.5
Cairo            Egypt   Spring               20.7              6.5
Cairo            Egypt    Summer              27.7              0.1
Cairo            Egypt     Fall               22.2              4.5

In [201]:
%load_ext sql

In [202]:
%sql sqlite://

'Connected: @None'

In [203]:
%%sql
CREATE TABLE WeatherData(City varchar(50), Country varchar(50), Season varchar(50), Temperature, Rainfall);
INSERT INTO WeatherData VALUES('Mumbai','India','Winter','24.8','5.9');
INSERT INTO WeatherData VALUES('Mumbai','India','Spring','28.4','16.2');
INSERT INTO WeatherData VALUES('Mumbai','India','Summer','27.9','1549.4');
INSERT INTO WeatherData VALUES('Mumbai','India','Fall','27.6','346.0');
INSERT INTO WeatherData VALUES('London','United Kingdom','Winter','4.2','207.7');
INSERT INTO WeatherData VALUES('London','United Kingdom','Spring','8.3','169.6');
INSERT INTO WeatherData VALUES('London','United Kingdom','Summer','15.7','157.0');
INSERT INTO WeatherData VALUES('London','United Kingdom','Fall','10.4','218.5');
INSERT INTO WeatherData VALUES('Cario','Egypt','Winter','13.6','16.5');
INSERT INTO WeatherData VALUES('Cario','Egypt','Spring','20.7','6.5');
INSERT INTO WeatherData VALUES('Cario','Egypt','Summer','27.7','0.1');
INSERT INTO WeatherData VALUES('Cario','Egypt','Fall','22.2','4.5');

 * sqlite://
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [204]:
%sql SELECT * from WeatherData

 * sqlite://
Done.

[('Mumbai', 'India', 'Winter', '24.8', '5.9'),
 ('Mumbai', 'India', 'Spring', '28.4', '16.2'),
 ('Mumbai', 'India', 'Summer', '27.9', '1549.4'),
 ('Mumbai', 'India', 'Fall', '27.6', '346.0'),
 ('London', 'United Kingdom', 'Winter', '4.2', '207.7'),
 ('London', 'United Kingdom', 'Spring', '8.3', '169.6'),
 ('London', 'United Kingdom', 'Summer', '15.7', '157.0'),
 ('London', 'United Kingdom', 'Fall', '10.4', '218.5'),
 ('Cario', 'Egypt', 'Winter', '13.6', '16.5'),
 ('Cario', 'Egypt', 'Spring', '20.7', '6.5'),
 ('Cario', 'Egypt', 'Summer', '27.7', '0.1'),
 ('Cario', 'Egypt', 'Fall', '22.2', '4.5')]

In [205]:
%sql SELECT Country, Rainfall from WeatherData

 * sqlite://
Done.

[('India', '5.9'),
 ('India', '16.2'),
 ('India', '1549.4'),
 ('India', '346.0'),
 ('United Kingdom', '207.7'),
 ('United Kingdom', '169.6'),
 ('United Kingdom', '157.0'),
 ('United Kingdom', '218.5'),
 ('Egypt', '16.5'),
 ('Egypt', '6.5'),
 ('Egypt', '0.1'),
 ('Egypt', '4.5')]

In [206]:
%sql SELECT * from WeatherData WHERE Country = 'Egypt';

 * sqlite://
Done.

[('Cario', 'Egypt', 'Winter', '13.6', '16.5'),
 ('Cario', 'Egypt', 'Spring', '20.7', '6.5'),
 ('Cario', 'Egypt', 'Summer', '27.7', '0.1'),
 ('Cario', 'Egypt', 'Fall', '22.2', '4.5')]

In [207]:
%sql SELECT DISTINCT City from WeatherData

 * sqlite://
Done.

[('Mumbai',), ('London',), ('Cario',)]

In [60]:
#Create table
import sqlite3
con = sqlite3.connect('web.db')
cur = con.cursor()

In [170]:
cur.execute("CREATE TABLE Weatherinfo55 (City, Country, Season, Temperature, Rainfall)")

In [171]:
cur.execute("INSERT INTO Weatherinfo55 VALUES ('Mumbai','India','Winter','24.8','5.9')")
cur.execute("INSERT INTO Weatherinfo55 VALUES ('Mumbai','India','Spring','28.4','16.2')")
cur.execute("INSERT INTO Weatherinfo55 VALUES ('Mumbai','India','Summer','27.9','1549.4')")
cur.execute("INSERT INTO Weatherinfo55 VALUES ('Mumbai','India','Fall','27.6','346.0')")
cur.execute("INSERT INTO Weatherinfo55 VALUES ('London','United Kingdom','Winter','4.2','207.7')")
cur.execute("INSERT INTO Weatherinfo55 VALUES ('London','United Kingdom','Spring','8.3','169.6')")
cur.execute("INSERT INTO Weatherinfo55 VALUES ('London', 'United Kingdom','Summer','15.7','157.0')")
cur.execute("INSERT INTO Weatherinfo55 VALUES ('London','United Kingdom','Fall','10.4','218.5')")
cur.execute("INSERT INTO Weatherinfo55 VALUES ('Cairo','Egypt','Winter','13.6','16.5')")
cur.execute("INSERT INTO Weatherinfo55 VALUES ('Cairo','Egypt','Spring','20.7','6.5')")
cur.execute("INSERT INTO Weatherinfo55 VALUES ('Cairo','Egypt','Summer','27.7','0.1')")
cur.execute("INSERT INTO Weatherinfo55 VALUES ('Cairo','Egypt','Fall','22.2','4.5')")

In [172]:
#command to save the table
con.commit()
con.close()

#### All Temperature Data

In [177]:
import sqlite3
con = sqlite3.connect('links.db')
cur = con.cursor()
cur.execute('SELECT Temperature FROM Weatherinfo55')

for b in cur:
    print(b)

('24.8',)
('28.4',)
('27.9',)
('27.6',)
('4.2',)
('8.3',)
('15.7',)
('10.4',)
('13.6',)
('20.7',)
('27.7',)
('22.2',)

#### All the cities, but without repetition.

In [184]:

import sqlite3
con = sqlite3.connect('links.db')
cur = con.cursor()
cur.execute('SELECT DISTINCT City FROM Weatherinfo55')

for b in cur:
    print(b)

('Mumbai',)
('London',)
('Cairo',)

#### All the records for India.

In [185]:
con = sqlite3.connect('links.db')
cur = con.cursor()
cur.execute('SELECT * FROM Weatherinfo55 WHERE City = "Mumbai"')

for b in cur:
    print(b)

('Mumbai', 'India', 'Winter', '24.8', '5.9')
('Mumbai', 'India', 'Spring', '28.4', '16.2')
('Mumbai', 'India', 'Summer', '27.9', '1549.4')
('Mumbai', 'India', 'Fall', '27.6', '346.0')

#### All the Fall records.

In [190]:
con = sqlite3.connect('links.db')
cur = con.cursor()
cur.execute('SELECT * FROM Weatherinfo55 WHERE Season = "Fall"')

for b in cur:
    print(b)

('Mumbai', 'India', 'Fall', '27.6', '346.0')
('London', 'United Kingdom', 'Fall', '10.4', '218.5')
('Cairo', 'Egypt', 'Fall', '22.2', '4.5')

#### The city and country for which the average Fall temperature is above 20 degrees, in increasing temperature order.

In [199]:
con = sqlite3.connect('links.db')
cur = con.cursor()
cur.execute('SELECT City, Country FROM Weatherinfo55 WHERE Season ="Fall" AND Temperature >= "20" ORDER BY Temperature')

for b in cur:
    print(b)

('Cairo', 'Egypt')
('Mumbai', 'India')

#### The city, country, and season for which the average rainfall is between 200 and 400 millimeters.

In [197]:
con = sqlite3.connect('links.db')
cur = con.cursor()
cur.execute('SELECT City, Country, Season FROM Weatherinfo55 WHERE Rainfall BETWEEN "200" AND "400"')

for b in cur:
    print(b)

('Mumbai', 'India', 'Fall')
('London', 'United Kingdom', 'Winter')
('London', 'United Kingdom', 'Fall')
('Cairo', 'Egypt', 'Fall')

####  The total annual rainfall for Cairo

In [211]:
con = sqlite3.connect('links.db')
cur = con.cursor()
cur.execute('SELECT SUM(Rainfall), City FROM Weatherinfo55 WHERE City ="Cairo"')

for b in cur:
    print(b)

(27.6, 'Cairo')

#### The total rainfall for each season

In [200]:
con = sqlite3.connect('links.db')
cur = con.cursor()
cur.execute('SELECT SUM(Rainfall),Season FROM Weatherinfo55 GROUP BY Season')

for b in cur:
    print(b)

(569.0, 'Fall')
(192.29999999999998, 'Spring')
(1706.5, 'Summer')
(230.1, 'Winter')

## Question 6

In [89]:
def binary(n):
    if n < 2:
        return [n]
    else:
        return binary(n // 2) + [n % 2]
        
binary(0)

[0]

In [92]:
binary (1)

[1]

In [90]:
binary(3)

[1, 1]

In [91]:
binary (9)

[1, 0, 0, 1]

## Question 5

In [147]:
def Collatz(x):
    while x != 1:
        print(x, end = ' ')
        if x & 1:
            x = 3 * x + 1
        else:
            x= x//2
    print(x)
    
Collatz (1)

1

In [148]:
Collatz (10)

10 5 16 8 4 2 1

In [156]:
from tkinter import Tk
root = Tk()
root.mainloop()

In [160]:
from tkinter import Tk, Label
root = Tk()
hello = Label(master = root, text = "Hello GUI world!")
hello.pack()
root.mainloop()

In [212]:
from tkinter import Tk, Label, PhotoImage
root = Tk()
photo = PhotoImage(file='C:\Users\brigh\Pictures\Passport Photograph Bright.jpg')

Bright = Label (master=root,
               image=photo,
               width=300,
               height=180)
Bright.pack()
root.mainloop()

SyntaxError: (unicode error) 'unicodeescape' codec can't decode bytes in position 2-3: truncated \UXXXXXXXX escape (<ipython-input-212-f8c1723059a9>, line 3)

## Question 4

In [225]:
from tkinter import Tk, Label, RAISED
root = Tk()
labels = [['MC', 'M+', 'M-', 'MR'],
           ['C' , '\u221a', 'x\u00b2', '+' ],
           ['7' , '8' , '9' , '-' ],
           ['4' , '5' , '6' , '*' ],
           ['1' , '2' , '3' , '/' ],
           ['0' , '.' , '+-', '=' ]]

for r in range(6):
    for c in range(4):
        label = Label(root, 
                      relief=RAISED,
                      padx=10,
                      text=labels[r] [c])
        label.grid(row=r, column =c)
root.mainloop()

In [228]:
from tkinter import *


root = Tk()



L = Label(root, text= 'Loan Amount:')
L.grid(row = 1)
A = Entry(root)
A.grid (row=1, column = 1)



I = Label(root, text= 'Interest rate:')

I.grid(row = 2)

R = Entry(root)

R.grid (row=2, column = 1)
    
    

T = Label(root, text= 'Loan Term:')

T.grid(row = 3)

E = Entry(root)

E.grid (row=3, column = 1)
    


C = Label(root, text= 'Compute Mortgage :')

C.grid(row = 4)

M = Entry(root)

M.grid (row=4, column = 1)
    
    

root.mainloop()

KeyboardInterrupt: